<a href="https://colab.research.google.com/github/trt38/Pandas-Challenge/blob/master/PyCitySchools.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Setup**

In [1]:
# Dependencies and Setup
import pandas as pd

In [6]:
# File to Load (Remember to Change These)
school_data_to_load = "/Resources/schools_complete.csv"
student_data_to_load = "/Resources/students_complete.csv"

In [7]:
# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [8]:
# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [9]:
#Display dataset
school_data_complete.head()

   Student ID       student_name gender  ...      type  size   budget
0           0       Paul Bradley      M  ...  District  2917  1910635
1           1       Victor Smith      M  ...  District  2917  1910635
2           2    Kevin Rodriguez      M  ...  District  2917  1910635
3           3  Dr. Richard Scott      M  ...  District  2917  1910635
4           4         Bonnie Ray      F  ...  District  2917  1910635

[5 rows x 11 columns]

In [17]:
#Display columns
school_data_complete.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

## **District Summary**

* Calculate the total number of schools
* Calculate the total number of students
* Calculate the total budget
* Calculate the average math score 
* Calculate the average reading score
* Calculate the percentage of students with a passing math score (70 or greater)
* Calculate the percentage of students with a passing reading score (70 or greater)
* Calculate the percentage of students who passed math and reading (% Overall Passing)
* Create a dataframe to hold the above results
* Optional: give the displayed data cleaner formatting

In [214]:
#Calculate the total number of schools
total_schools = len(school_data_complete["School ID"].unique())
total_schools

15

In [215]:
#Calculate the total number of students
total_students = len(school_data_complete["Student ID"].unique())
total_students

39170

In [216]:
#Calculate the total budget
total_budget = school_data["budget"].sum()
total_budget

24649428

In [217]:
#Calculate the average math score
math_avg = round(student_data["math_score"].mean(),2)
math_avg

78.99

In [218]:
#Calculate the average reading score
read_avg = round(student_data["reading_score"].mean(), 2)
read_avg

81.88

In [219]:
#Calculate the percentage of students with a passing math score (70 or greater)
passing_math = len(school_data_complete.loc[school_data_complete["math_score"] >= 70, :])
passing_mperc = round((passing_math / total_students) * 100, 2)
passing_mperc

74.98

In [220]:
#Calculate the percentage of students with a passing reading score (70 or greater)
passing_read = len(school_data_complete.loc[school_data_complete["reading_score"] >= 70, :])
passing_rperc = round((passing_read / total_students) * 100,2)
passing_rperc

85.81

In [221]:
#Calculate the percentage of students who passed math and reading (% Overall Passing)
passing_both = len(school_data_complete.loc[(school_data_complete["reading_score"] >= 70) & (school_data_complete["math_score"] >= 70), :])
passing_bperc = round((passing_both / total_students) * 100,2)
passing_bperc

65.17

In [222]:
#Create a dataframe to hold the above results
dist_summary = pd.DataFrame({"Total Schools": [total_schools],
                              "Total Students": [total_students],
                              "Total Budget": [total_budget],
                              "Average Math Score": [math_avg],
                              "Average Reading Score": [read_avg],
                              "% Passing Math": [passing_mperc],
                              "% Passing Reading": [passing_rperc],
                              "% Overall Passing Rate": [passing_bperc]})

dist_summary.head()

   Total Schools  Total Students  ...  % Passing Reading  % Overall Passing Rate
0             15           39170  ...              85.81                   65.17

[1 rows x 8 columns]

## **School Summary**

Create an overview table that summarizes key metrics about each school, including:

* School Name
* School Type
* Total Students
* Total School Budget
* Per Student Budget
* Average Math Score
* Average Reading Score
* % Passing Math
* % Passing Reading
* % Overall Passing (The percentage of students that passed math and reading.)

Create a dataframe to hold the above results

In [259]:
school_data_complete.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [260]:
#Create groupby by school name
data_by_school = school_data_complete.groupby(["school_name"])

data_by_school.count().head()

                      Student ID  student_name  gender  ...  type  size  budget
school_name                                             ...
Bailey High School          4976          4976    4976  ...  4976  4976    4976
Cabrera High School         1858          1858    1858  ...  1858  1858    1858
Figueroa High School        2949          2949    2949  ...  2949  2949    2949
Ford High School            2739          2739    2739  ...  2739  2739    2739
Griffin High School         1468          1468    1468  ...  1468  1468    1468

[5 rows x 10 columns]

In [261]:
#Variable for passing math
math_pass = school_data_complete.loc[school_data_complete['math_score']>=70].groupby(["school_name"]).size()

In [262]:
#Variable for passing reading
read_pass = school_data_complete.loc[school_data_complete['reading_score']>=70].groupby(["school_name"]).size()

In [263]:
#Variable for passing both
both_pass = school_data_complete.loc[(school_data_complete["reading_score"] >= 70) & (school_data_complete["math_score"] >= 70)].groupby(["school_name"]).size()

In [264]:
#Create dataframe to hold new columns
school_df = pd.DataFrame(school_data_complete["school_name"].value_counts())

In [265]:
#create columns for key metrics
school_df["School Type"] = data_by_school["type"].first()
school_df["Total Students"] = data_by_school["Student ID"].count()
school_df["Total School Budget"] = data_by_school["budget"].mean().map('${:,.2f}'.format)
school_df["Per Student Budget"] = (data_by_school["budget"].mean() / data_by_school["Student ID"].count()).map('${:,.2f}'.format)
school_df["Average Math Score"] = round(data_by_school["math_score"].mean(),2)
school_df["Average Reading Score"] = round(data_by_school["reading_score"].mean(),2)
school_df["% Passing Math"] = round((math_pass/data_by_school["Student ID"].count())*100,2)
school_df["% Passing Reading"] = round((read_pass/data_by_school["Student ID"].count())*100,2)
school_df["% Overall Passing"] = round((both_pass/data_by_school["Student ID"].count())*100,2)


school_df.head()

                       school_name  ... % Overall Passing
Bailey High School            4976  ...             54.64
Johnson High School           4761  ...             53.54
Hernandez High School         4635  ...             53.53
Rodriguez High School         3999  ...             52.99
Figueroa High School          2949  ...             53.20

[5 rows x 10 columns]

In [266]:
#Reorder columns
school_df = school_df[["School Type", "Total Students", "Total School Budget", "Per Student Budget", 
                                             "Average Math Score", "Average Reading Score","% Passing Math", "% Passing Reading", 
                                             "% Overall Passing"]]
school_df.head()

                      School Type  ...  % Overall Passing
Bailey High School       District  ...              54.64
Johnson High School      District  ...              53.54
Hernandez High School    District  ...              53.53
Rodriguez High School    District  ...              52.99
Figueroa High School     District  ...              53.20

[5 rows x 9 columns]

## **Top Performing Schools (By % Overall Passing)**

* Sort and display the top five performing schools by % overall passing.

In [267]:
# Sort and display the top five performing schools by % overall passing.
top5_df = school_df.sort_values("% Overall Passing", ascending=False)
top5_df.head(5)

                    School Type  ...  % Overall Passing
Cabrera High School     Charter  ...              91.33
Thomas High School      Charter  ...              90.95
Griffin High School     Charter  ...              90.60
Wilson High School      Charter  ...              90.58
Pena High School        Charter  ...              90.54

[5 rows x 9 columns]

## **Bottom Performing Schools (By % Overall Passing)**

* Sort and display the five worst-performing schools by % overall passing.

In [268]:
# Sort and display the five worst-performing schools by % overall passing.
bottom5_df = school_df.sort_values("% Overall Passing", ascending=True)
bottom5_df.head(5)

                      School Type  ...  % Overall Passing
Rodriguez High School    District  ...              52.99
Figueroa High School     District  ...              53.20
Huang High School        District  ...              53.51
Hernandez High School    District  ...              53.53
Johnson High School      District  ...              53.54

[5 rows x 9 columns]

## **Math Scores by Grade**

Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

* Create a pandas series for each grade. Hint: use a conditional statement.
* Group each series by school
* Combine the series into a dataframe
* Optional: give the displayed data cleaner formatting

In [299]:
# Create a pandas series for each grade. Hint: use a conditional statement.
# Group each series by school

avg_math9 = school_data_complete[school_data_complete["grade"]=="9th"].groupby(["school_name"]).mean()["math_score"]
avg_math10 = school_data_complete[school_data_complete["grade"]=="10th"].groupby(["school_name"]).mean()["math_score"]
avg_math11 = school_data_complete[school_data_complete["grade"]=="11th"].groupby(["school_name"]).mean()["math_score"]
avg_math12 = school_data_complete[school_data_complete["grade"]=="12th"].groupby(["school_name"]).mean()["math_score"]

In [300]:
# Combine the series into a dataframe

math_gradelvl = pd.merge(avg_math9, avg_math10, on="school_name")
math_gradelvl = pd.merge(math_gradelvl, avg_math11, on="school_name")
math_gradelvl = pd.merge(math_gradelvl, avg_math12, on="school_name")
math_gradelvl.columns = ["9th Grade","10th Grade","11th Grade","12th Grade"]

math_gradelvl

                       9th Grade  10th Grade  11th Grade  12th Grade
school_name
Bailey High School     77.083676   76.996772   77.515588   76.492218
Cabrera High School    83.094697   83.154506   82.765560   83.277487
Figueroa High School   76.403037   76.539974   76.884344   77.151369
Ford High School       77.361345   77.672316   76.918058   76.179963
Griffin High School    82.044010   84.229064   83.842105   83.356164
Hernandez High School  77.438495   77.337408   77.136029   77.186567
Holden High School     83.787402   83.429825   85.000000   82.855422
Huang High School      77.027251   75.908735   76.446602   77.225641
Johnson High School    77.187857   76.691117   77.491653   76.863248
Pena High School       83.625455   83.372000   84.328125   84.121547
Rodriguez High School  76.859966   76.612500   76.395626   77.690748
Shelton High School    83.420755   82.917411   83.383495   83.778976
Thomas High School     83.590022   83.087886   83.498795   83.497041
Wilson High School     83.085578   83.724422   83.195326   83.035794
Wright High School     83.264706   84.010288   83.836782   83.644986

## **Reading Score by Grade**

* Perform the same operations as above for reading scores

In [301]:
# Create a pandas series for each grade. Hint: use a conditional statement.
# Group each series by school

avg_read9 = school_data_complete[school_data_complete["grade"]=="9th"].groupby(["school_name"]).mean()["reading_score"]
avg_read10 = school_data_complete[school_data_complete["grade"]=="10th"].groupby(["school_name"]).mean()["reading_score"]
avg_read11 = school_data_complete[school_data_complete["grade"]=="11th"].groupby(["school_name"]).mean()["reading_score"]
avg_read12 = school_data_complete[school_data_complete["grade"]=="12th"].groupby(["school_name"]).mean()["reading_score"]

In [302]:
# Combine the series into a dataframe

read_gradelvl = pd.merge(avg_read9, avg_read10, on="school_name")
read_gradelvl = pd.merge(read_gradelvl, avg_read11, on="school_name")
read_gradelvl = pd.merge(read_gradelvl, avg_read12, on="school_name")
read_gradelvl.columns = ["9th Grade","10th Grade","11th Grade","12th Grade"]

read_gradelvl

                       9th Grade  10th Grade  11th Grade  12th Grade
school_name
Bailey High School     81.303155   80.907183   80.945643   80.912451
Cabrera High School    83.676136   84.253219   83.788382   84.287958
Figueroa High School   81.198598   81.408912   80.640339   81.384863
Ford High School       80.632653   81.262712   80.403642   80.662338
Griffin High School    83.369193   83.706897   84.288089   84.013699
Hernandez High School  80.866860   80.660147   81.396140   80.857143
Holden High School     83.677165   83.324561   83.815534   84.698795
Huang High School      81.290284   81.512386   81.417476   80.305983
Johnson High School    81.260714   80.773431   80.616027   81.227564
Pena High School       83.807273   83.612000   84.335938   84.591160
Rodriguez High School  80.993127   80.629808   80.864811   80.376426
Shelton High School    84.122642   83.441964   84.373786   82.781671
Thomas High School     83.728850   84.254157   83.585542   83.831361
Wilson High School     83.939778   84.021452   83.764608   84.317673
Wright High School     83.833333   83.812757   84.156322   84.073171

## **Scores by School Spending**

Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
* Average Math Score
* Average Reading Score
* % Passing Math
* % Passing Reading
*Overall Passing Rate (Average of the above two)

In [354]:
#Create dataframe
spend_df_1 = school_df[["Average Math Score",
                                  "Average Reading Score","% Passing Math",
                                  "% Passing Reading","% Overall Passing"]]

spend_df = pd.DataFrame(spend_df_1)

spend_df

                       Average Math Score  ...  % Overall Passing
Bailey High School                  77.05  ...              54.64
Johnson High School                 77.07  ...              53.54
Hernandez High School               77.29  ...              53.53
Rodriguez High School               76.84  ...              52.99
Figueroa High School                76.71  ...              53.20
Huang High School                   76.63  ...              53.51
Ford High School                    77.10  ...              54.29
Wilson High School                  83.27  ...              90.58
Cabrera High School                 83.06  ...              91.33
Wright High School                  83.68  ...              90.33
Shelton High School                 83.36  ...              89.89
Thomas High School                  83.42  ...              90.95
Griffin High School                 83.35  ...              90.60
Pena High School                    83.84  ...              90.54
Holden High School                  83.80  ...              89.23

[15 rows x 5 columns]

In [355]:
# Create bins for data
spendbins = [0, 585, 630, 645, 675]
spendgroups = ["Under $585", "$585-629", "$630-644", "$645-675"]

In [356]:
spend_df["Spending Ranges (Per Student)"] = pd.cut(school_df["Per Student Budget"], spendbins, labels=spendgroups, include_lowest=True)

spend_df.head()

TypeError: ignored

In [357]:
#Create goup based on bins
spend_df = spend_df.groupby("Spending Ranges (Per Student)")
spend_df

KeyError: ignored

## **Scores by School Size**
Create a table that breaks down school performances based on average School Size. Use 4 reasonable bins to group school spending. Include in the table each of the following:

* Average Math Score
* Average Reading Score
* % Passing Math
* % Passing Reading
* Overall Passing Rate (Average of the above two)

In [358]:
#Create dataframe
size_df_1 = school_df[["Average Math Score",
                                  "Average Reading Score","% Passing Math",
                                  "% Passing Reading","% Overall Passing"]]

size_df = pd.DataFrame(size_df_1)

size_df

                       Average Math Score  ...  % Overall Passing
Bailey High School                  77.05  ...              54.64
Johnson High School                 77.07  ...              53.54
Hernandez High School               77.29  ...              53.53
Rodriguez High School               76.84  ...              52.99
Figueroa High School                76.71  ...              53.20
Huang High School                   76.63  ...              53.51
Ford High School                    77.10  ...              54.29
Wilson High School                  83.27  ...              90.58
Cabrera High School                 83.06  ...              91.33
Wright High School                  83.68  ...              90.33
Shelton High School                 83.36  ...              89.89
Thomas High School                  83.42  ...              90.95
Griffin High School                 83.35  ...              90.60
Pena High School                    83.84  ...              90.54
Holden High School                  83.80  ...              89.23

[15 rows x 5 columns]

In [359]:
# Create bins for data
sizebins = [0, 1000, 2000, 5000]
sizegroups = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

In [360]:
size_df["School Size"] = pd.cut(school_df["Total Students"], sizebins, labels=sizegroups, include_lowest=True)

size_df.head()

                       Average Math Score  ...        School Size
Bailey High School                  77.05  ...  Large (2000-5000)
Johnson High School                 77.07  ...  Large (2000-5000)
Hernandez High School               77.29  ...  Large (2000-5000)
Rodriguez High School               76.84  ...  Large (2000-5000)
Figueroa High School                76.71  ...  Large (2000-5000)

[5 rows x 6 columns]

In [364]:
#Create goup based on bins
size_df = size_df.groupby("School Size")
size_df

AttributeError: ignored

## **Scores by School Type**
Create a table that breaks down school performances based on average School Size. Use 4 reasonable bins to group school spending. Include in the table each of the following:

* Average Math Score
* Average Reading Score
* % Passing Math
* % Passing Reading
* Overall Passing Rate (Average of the above two)

In [365]:
#Create dataframe
type_df_1 = school_df[["Average Math Score",
                                  "Average Reading Score","% Passing Math",
                                  "% Passing Reading","% Overall Passing"]]

type_df = pd.DataFrame(type_df_1)

type_df

                       Average Math Score  ...  % Overall Passing
Bailey High School                  77.05  ...              54.64
Johnson High School                 77.07  ...              53.54
Hernandez High School               77.29  ...              53.53
Rodriguez High School               76.84  ...              52.99
Figueroa High School                76.71  ...              53.20
Huang High School                   76.63  ...              53.51
Ford High School                    77.10  ...              54.29
Wilson High School                  83.27  ...              90.58
Cabrera High School                 83.06  ...              91.33
Wright High School                  83.68  ...              90.33
Shelton High School                 83.36  ...              89.89
Thomas High School                  83.42  ...              90.95
Griffin High School                 83.35  ...              90.60
Pena High School                    83.84  ...              90.54
Holden High School                  83.80  ...              89.23

[15 rows x 5 columns]

In [366]:
# Create bins for data
typebins = [Charter, District]
typegroups = ["Charter", "District"]

NameError: ignored

In [367]:
type_df["School Type"] = pd.cut(school_df["School Type"], typebins, labels=typegroups, include_lowest=True)

type_df.head()

NameError: ignored